Revit 2027 API
RebarCurvesData.ClearAllAddedBarGeometry Method
 This function will remove all bars geometry that were added by calling AddBarGeometry().
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void ClearAllAddedBarGeometry()
Public Sub ClearAllAddedBarGeometry
public:
void ClearAllAddedBarGeometry()
member ClearAllAddedBarGeometry : unit -> unit
See Also
Reference
RebarCurvesData Class
Autodesk.Revit.DB.Structure Namespace